In [2]:
import pandas as pd

In [3]:
tables = pd.read_html("https://www.w3schools.com/html/html_tables.asp", header=0)

In [4]:
table = tables[0]

In [5]:
table

                        Company           Contact  Country
0           Alfreds Futterkiste      Maria Anders  Germany
1    Centro comercial Moctezuma   Francisco Chang   Mexico
2                  Ernst Handel     Roland Mendel  Austria
3                Island Trading     Helen Bennett       UK
4  Laughing Bacchus Winecellars   Yoshi Tannamuri   Canada
5  Magazzini Alimentari Riuniti  Giovanni Rovelli    Italy

In [6]:
table.to_excel("info.xlsx")

In [8]:
type(table["Company"])

pandas.core.series.Series

In [9]:
type(table)

pandas.core.frame.DataFrame

In [10]:
names = ["Anuj", "Ravi", "Gagan", "Tapan", "Rohan"]

In [23]:
ages = [28, 21, 15, 21, 23]

vals = [21, 15, 21, 23, 28]

In [13]:
s_names = pd.Series(names)

In [14]:
s_ages = pd.Series(ages)

In [17]:
pd.DataFrame([s_names, s_ages]).T

       0   1
0   Anuj  28
1   Ravi  21
2  Gagan  15
3  Tapan  21
4  Rohan  23

In [24]:
data = {}
data["name"] = names
data["age"] = ages
data["values"] = vals

pd.DataFrame(data)

    name  age  values
0   Anuj   28      21
1   Ravi   21      15
2  Gagan   15      21
3  Tapan   21      23
4  Rohan   23      28

In [26]:
data = list(zip(names, ages, vals))

In [27]:
pd.DataFrame(data)

       0   1   2
0   Anuj  28  21
1   Ravi  21  15
2  Gagan  15  21
3  Tapan  21  23
4  Rohan  23  28

In [28]:
import numpy as np

In [29]:
data = np.random.randint(10, 20, (10, 5))